simondlevy/Hackflight/attic/dshot/stm32/stm32f4/src/io_def_generated.h
#define DEFIO_TAG__PF9 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 9)
#define DEFIO_TAG_E__PF9 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 9)
#define DEFIO_REC__PF9 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(9) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PF10 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 10)
#define DEFIO_TAG_E__PF10 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 10)
#define DEFIO_REC__PF10 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(10) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PF11 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 11)
#define DEFIO_TAG_E__PF11 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 11)
#define DEFIO_REC__PF11 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(11) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PF12 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 12)
#define DEFIO_TAG_E__PF12 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 12)
#define DEFIO_REC__PF12 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(12) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PF13 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 13)
#define DEFIO_TAG_E__PF13 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 13)
#define DEFIO_REC__PF13 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(13) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PF14 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 14)
#define DEFIO_TAG_E__PF14 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 14)
#define DEFIO_REC__PF14 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(14) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PF15 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 15)
#define DEFIO_TAG_E__PF15 DEFIO_TAG_MAKE(DEFIO_GPIOID__F, 15)
#define DEFIO_REC__PF15 DEFIO_REC_INDEXED(BITCOUNT(DEFIO_PORT_F_USED_MASK & (BIT(15) - 1)) + DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT)

#define DEFIO_TAG__PG0 defio_error_PG0_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG0 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG0 defio_error_PG0_is_not_supported_on_TARGET

#define DEFIO_TAG__PG1 defio_error_PG1_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG1 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG1 defio_error_PG1_is_not_supported_on_TARGET

#define DEFIO_TAG__PG2 defio_error_PG2_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG2 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG2 defio_error_PG2_is_not_supported_on_TARGET

#define DEFIO_TAG__PG3 defio_error_PG3_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG3 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG3 defio_error_PG3_is_not_supported_on_TARGET

#define DEFIO_TAG__PG4 defio_error_PG4_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG4 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG4 defio_error_PG4_is_not_supported_on_TARGET

#define DEFIO_TAG__PG5 defio_error_PG5_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG5 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG5 defio_error_PG5_is_not_supported_on_TARGET

#define DEFIO_TAG__PG6 defio_error_PG6_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG6 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG6 defio_error_PG6_is_not_supported_on_TARGET

#define DEFIO_TAG__PG7 defio_error_PG7_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG7 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG7 defio_error_PG7_is_not_supported_on_TARGET

#define DEFIO_TAG__PG8 defio_error_PG8_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG8 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG8 defio_error_PG8_is_not_supported_on_TARGET

#define DEFIO_TAG__PG9 defio_error_PG9_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG9 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG9 defio_error_PG9_is_not_supported_on_TARGET

#define DEFIO_TAG__PG10 defio_error_PG10_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG10 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG10 defio_error_PG10_is_not_supported_on_TARGET

#define DEFIO_TAG__PG11 defio_error_PG11_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG11 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG11 defio_error_PG11_is_not_supported_on_TARGET

#define DEFIO_TAG__PG12 defio_error_PG12_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG12 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG12 defio_error_PG12_is_not_supported_on_TARGET

#define DEFIO_TAG__PG13 defio_error_PG13_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG13 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG13 defio_error_PG13_is_not_supported_on_TARGET

#define DEFIO_TAG__PG14 defio_error_PG14_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG14 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG14 defio_error_PG14_is_not_supported_on_TARGET

#define DEFIO_TAG__PG15 defio_error_PG15_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PG15 DEFIO_TAG_E__NONE
#define DEFIO_REC__PG15 defio_error_PG15_is_not_supported_on_TARGET

#define DEFIO_TAG__PH0 defio_error_PH0_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH0 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH0 defio_error_PH0_is_not_supported_on_TARGET

#define DEFIO_TAG__PH1 defio_error_PH1_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH1 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH1 defio_error_PH1_is_not_supported_on_TARGET

#define DEFIO_TAG__PH2 defio_error_PH2_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH2 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH2 defio_error_PH2_is_not_supported_on_TARGET

#define DEFIO_TAG__PH3 defio_error_PH3_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH3 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH3 defio_error_PH3_is_not_supported_on_TARGET

#define DEFIO_TAG__PH4 defio_error_PH4_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH4 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH4 defio_error_PH4_is_not_supported_on_TARGET

#define DEFIO_TAG__PH5 defio_error_PH5_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH5 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH5 defio_error_PH5_is_not_supported_on_TARGET

#define DEFIO_TAG__PH6 defio_error_PH6_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH6 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH6 defio_error_PH6_is_not_supported_on_TARGET

#define DEFIO_TAG__PH7 defio_error_PH7_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH7 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH7 defio_error_PH7_is_not_supported_on_TARGET

#define DEFIO_TAG__PH8 defio_error_PH8_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH8 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH8 defio_error_PH8_is_not_supported_on_TARGET

#define DEFIO_TAG__PH9 defio_error_PH9_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH9 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH9 defio_error_PH9_is_not_supported_on_TARGET

