simondlevy/Hackflight/attic/dshot/stm32/stm32f4/src/io_def_generated.h
#define DEFIO_TAG__PH10 defio_error_PH10_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH10 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH10 defio_error_PH10_is_not_supported_on_TARGET

#define DEFIO_TAG__PH11 defio_error_PH11_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH11 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH11 defio_error_PH11_is_not_supported_on_TARGET

#define DEFIO_TAG__PH12 defio_error_PH12_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH12 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH12 defio_error_PH12_is_not_supported_on_TARGET

#define DEFIO_TAG__PH13 defio_error_PH13_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH13 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH13 defio_error_PH13_is_not_supported_on_TARGET

#define DEFIO_TAG__PH14 defio_error_PH14_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH14 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH14 defio_error_PH14_is_not_supported_on_TARGET

#define DEFIO_TAG__PH15 defio_error_PH15_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PH15 DEFIO_TAG_E__NONE
#define DEFIO_REC__PH15 defio_error_PH15_is_not_supported_on_TARGET

#define DEFIO_TAG__PI0 defio_error_PI0_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI0 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI0 defio_error_PI0_is_not_supported_on_TARGET

#define DEFIO_TAG__PI1 defio_error_PI1_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI1 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI1 defio_error_PI1_is_not_supported_on_TARGET

#define DEFIO_TAG__PI2 defio_error_PI2_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI2 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI2 defio_error_PI2_is_not_supported_on_TARGET

#define DEFIO_TAG__PI3 defio_error_PI3_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI3 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI3 defio_error_PI3_is_not_supported_on_TARGET

#define DEFIO_TAG__PI4 defio_error_PI4_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI4 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI4 defio_error_PI4_is_not_supported_on_TARGET

#define DEFIO_TAG__PI5 defio_error_PI5_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI5 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI5 defio_error_PI5_is_not_supported_on_TARGET

#define DEFIO_TAG__PI6 defio_error_PI6_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI6 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI6 defio_error_PI6_is_not_supported_on_TARGET

#define DEFIO_TAG__PI7 defio_error_PI7_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI7 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI7 defio_error_PI7_is_not_supported_on_TARGET

#define DEFIO_TAG__PI8 defio_error_PI8_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI8 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI8 defio_error_PI8_is_not_supported_on_TARGET

#define DEFIO_TAG__PI9 defio_error_PI9_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI9 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI9 defio_error_PI9_is_not_supported_on_TARGET

#define DEFIO_TAG__PI10 defio_error_PI10_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI10 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI10 defio_error_PI10_is_not_supported_on_TARGET

#define DEFIO_TAG__PI11 defio_error_PI11_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI11 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI11 defio_error_PI11_is_not_supported_on_TARGET

#define DEFIO_TAG__PI12 defio_error_PI12_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI12 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI12 defio_error_PI12_is_not_supported_on_TARGET

#define DEFIO_TAG__PI13 defio_error_PI13_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI13 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI13 defio_error_PI13_is_not_supported_on_TARGET

#define DEFIO_TAG__PI14 defio_error_PI14_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI14 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI14 defio_error_PI14_is_not_supported_on_TARGET

#define DEFIO_TAG__PI15 defio_error_PI15_is_not_supported_on_TARGET
#define DEFIO_TAG_E__PI15 DEFIO_TAG_E__NONE
#define DEFIO_REC__PI15 defio_error_PI15_is_not_supported_on_TARGET

// DEFIO_IO_USED_COUNT is number of io pins supported on target
#define DEFIO_IO_USED_COUNT (DEFIO_PORT_A_USED_COUNT+DEFIO_PORT_B_USED_COUNT+DEFIO_PORT_C_USED_COUNT+DEFIO_PORT_D_USED_COUNT+DEFIO_PORT_E_USED_COUNT+DEFIO_PORT_F_USED_COUNT+DEFIO_PORT_G_USED_COUNT+DEFIO_PORT_H_USED_COUNT+DEFIO_PORT_I_USED_COUNT)

#define DEFIO_PORT_USED_COUNT 6
#define DEFIO_PORT_USED_LIST DEFIO_PORT_A_USED_MASK,DEFIO_PORT_B_USED_MASK,DEFIO_PORT_C_USED_MASK,DEFIO_PORT_D_USED_MASK,DEFIO_PORT_E_USED_MASK,DEFIO_PORT_F_USED_MASK
#define DEFIO_PORT_OFFSET_LIST DEFIO_PORT_A_OFFSET,DEFIO_PORT_B_OFFSET,DEFIO_PORT_C_OFFSET,DEFIO_PORT_D_OFFSET,DEFIO_PORT_E_OFFSET,DEFIO_PORT_F_OFFSET
